www/phensim/app/Services/DashboardService.php

select status, count(*) as count from `simulations` group by `status`
---
        if ($user === null) {
            throw new ServiceException('User is not logged in');
        }
        $data = Simulation::visible()
                          ->groupBy('status')
                          ->selectRaw('status, count(*) as count')
                          ->pluck('count', 'status');

select * from `messages` order by `created_at` desc limit 5
---
    public function getLatestUpdates(): Collection|array
    {
        return Message::latest()->take(5)->get();